#맵1 광물 자원 데이터
#rock_count = {1:0,2:0,3:0,4:0}
rock_count = {1:500,2:500,3:500,4:500} #버그판

#upgrade 현재 수치
atk = 0
heart = 0
deff = 0
ship = 0


#upgrade시 필요한 광물 개수
req_atk = {1:50, 2:100, 3:150, 4:200, 5:250, 6:300, 7:350}
req_heart = {1:40, 2:80, 3:120, 4:160, 5:200, 6:240, 7:280}
req_def = {1:30, 2:60, 3:90, 4:120, 5:150, 6:180, 7:210}
req_ship = {1:20, 2:30, 3:40, 4:50, 5:60, 6:70, 7:80}

#현재 각 LV
atk_lv=1
heart_lv=1
def_lv=1
ship_lv=1

#================================================================
#인게임 우주선 스텟 데이터
speed = 250
hp = 300
max_hp = 300
level = 1
